<script lang="ts">
	import { browser } from '$app/environment';

	let loggedIn: boolean = $state(false);
	if (browser) {
		loggedIn = localStorage.getItem('loggedIn') ? true : false;
	}
</script>

{#if loggedIn}
	<h2>Кто такие менторы?</h2>
	<p>
		Менторы - это опытные профессионалы, имеющие достаточный уровень экспертизы в своей области и
		готовые делиться знаниями с новичками, помогая им разобраться в различных сложностях. Они
		выступают в роли наставников, направляя подопечных, предостерегая их от типичных ошибок и
		способствуя более быстрому профессиональному росту. Важной особенностью менторства является не
		просто передача теоретических знаний, но и практического опыта, который был накоплен годами
		работы в определенной сфере. Ментор помогает своему подопечному выстроить правильную траекторию
		развития, определить приоритетные направления обучения и освоить необходимые навыки наиболее
		эффективным способом. Менторство особенно ценно тем, что позволяет начинающим специалистам
		учиться на чужом опыте, избегая многих проблем и ускоряя свой профессиональный рост. При этом
		ментор не просто дает готовые решения, а помогает развить самостоятельное мышление и способность
		находить оптимальные пути решения задач.
	</p>
	<h2>Что должны делать менторы?</h2>
	<p>
		Менторы должны быть внимательны к запросам о помощи, проявлять отзывчивость и искреннее желание
		помочь ученикам разобраться в новых и непонятных для них темах. Успешный ментор не просто
		отвечает на вопросы, но и старается понять глубину проблемы, выявить пробелы в знаниях и помочь
		выстроить системное понимание предмета. В любой сфере, включая подготовку к ЕГЭ, ментор помогает
		правильно расставить приоритеты, избежать типичных ошибок и выработать эффективную стратегию
		достижения цели. Важная задача ментора - направить подопечного на правильный путь, поделиться
		опытом и помочь выделить действительно важные аспекты. При работе с подопечными менторы должны
		учитывать не только профессиональную составляющую, но и психологический аспект. Важно уметь
		мотивировать, поддерживать уверенность в собственных силах и помогать справляться с
		тревожностью. Хороший ментор также способствует развитию самостоятельности, делится проверенными
		практиками и помогает найти наиболее подходящие индивидуальные решения. Кроме того, современный
		ментор должен быть гибким в выборе форматов работы, используя как традиционные подходы, так и
		современные технологии, которые могут сделать процесс взаимодействия более эффективным.
	</p>
	<h2>Что не должны делать менторы?</h2>
	<p>
		Менторы не должны игнорировать запросы учеников или отвечать на вопросы грубо, без искреннего
		стремления помочь разобраться в той или иной теме неопытному человеку. Такое поведение
		противоречит самой сути менторства, которая заключается в доброжелательной поддержке и передаче
		опыта. Пренебрежительное отношение к вопросам подопечных может серьезно демотивировать их,
		снизить уверенность в себе и желание развиваться дальше. Даже если вопрос кажется ментору
		элементарным, важно помнить, что для начинающего специалиста эта тема может быть действительно
		сложной и непонятной. Профессиональный ментор всегда проявляет терпение и понимание. Формальные,
		поверхностные ответы без стремления действительно помочь разобраться в проблеме также
		недопустимы. Если ментор не готов уделить достаточно внимания вопросу или не обладает
		необходимыми знаниями в конкретной области, лучше честно об этом сказать и, возможно,
		посоветовать обратиться к другому специалисту. Важно создавать атмосферу, в которой подопечный
		не боится задавать вопросы и признаваться в том, что чего-то не понимает. Конструктивный диалог,
		уважительное отношение и искреннее желание помочь - это ключевые принципы успешного менторства,
		которые позволяют выстроить доверительные отношения и достичь максимальной эффективности в
		передаче опыта. Более того, негативный опыт взаимодействия с ментором может отбить у человека
		желание обращаться за помощью в будущем, что затормозит его профессиональное развитие. Поэтому
		ответственность ментора заключается не только в передаче знаний, но и в создании позитивного
		опыта наставничества.
	</p>
	<mark>
		ВАЖНО: если вы понимаете, что не готовы отвечать вышеперечисленым требованиям, просим вас не
		подавать заявку на становление ментором.
	</mark>
	<h1>Заявка на становление ментором</h1>
	<form action="" method="POST">
		<hgroup>
			<h3>В чем ваша специализация?</h3>
			<p>Можно написать несколько</p>
		</hgroup>
		<textarea name="direction" id="direction"></textarea>
		<button type="submit">Подать заявку</button>
	</form>
{:else}
	<h1>Необходима регистрация</h1>
	<h3>
		Для отправки заявки на становление ментором необходимо <a href="/signup">зарегистрироваться</a>.
	</h3>
{/if}
